
Салют, Вера
Девушки Из Высшего Общества
Черная Кошка
Се ля ви
Самба Белого Мотылька
Сто шагов назад
Королева автострады
Актриса
Текила-любовь
Балерина
Белые птицы
Два-ноль-ноль-ноль
Осколки лета
Золотистый Локон
Так и скажи
Красавицы могут все
Свет уходящего солнца
Звёздочка моя ясная
Чего не могут люди
Свадьба
Ночь Накануне Рождества
Сэра
Как ты красива сегодня
Холодное сердце
Говорила ты
Не тревожь мне душу скрипка
Чуть Ниже Небес
Безответно
Без суеты
Береги себя, мой ангел
Мечта
Малиновое вино
Магдалина
